Repository: markwk/openatrium
Catalog: translations/*.po
Languages: ur, zh_hans

source: Requirements problem
ur: ضروریات
zh_hans: 需求问题

source: Database configuration
ur: دیٹابیس کا سیٹ اپ
zh_hans: 数据库配置

source: Your web server does not appear to support any common database types. Check with your hosting provider to see if they offer any databases that <a href="@drupal-databases">Drupal supports</a>.
ur: آپکا ویب سرور بظاھر کسی مشترک ڈیٹابیس کی اقسام کو مدد نھیں دیتا۔اپنے ویب ھوسٹ پروائیڈر سے تصدیق کیجھیے کہ وہ کیا وہ کوئی ایسا دیٹابیس دیتا ھے جو <a href="@drupal-databases"> ڈروپل سپورز</a>.
zh_hans: 您的 WEB 服务器似乎不支持任何通用数据库类型，请联系您的空间商询问是否提供 <a href="@drupal-databases">Drupal 支持的数据库</a>。

source: Basic options
ur: بنیادی انتخابات
zh_hans: 基本选项

source: To set up your @drupal database, enter the following information.
ur: اپنے @drupal ڈیٹابیس کو سیٹ کرنے کے لیے ،مندرجہ ذیل معلومات دیجھیے۔
zh_hans: 请输入下列信息以设置您的 @drupal 数据库。

source: Database type
ur: ڈیٹابیس کی اقسام
zh_hans: 数据库类型

source: The type of database your @drupal data will be stored in.
ur: آپکے ڈیٹابیس کا نام جس مییں @drupal کا ڈیٹا محفوظھوگا۔
zh_hans: 您的 @drupal 数据保存的数据库类型。

source: The name of the database your @drupal data will be stored in. It must exist on your server before @drupal can be installed.
ur: اس ڈیٹابیس کا نام جس میں @drupal کا ڈیٹا محفوظ ھو۔۔اسے اپ کے سرور پر @drupal اسنٹال ھونے سے پھلے موجود ھونا چاھیے۔
zh_hans: 您的 @drupal 数据要保存到的%db_type类数据库名称。在 @drupal 安装前必须准备好。

source: The name of the %db_type database your @drupal data will be stored in. It must exist on your server before @drupal can be installed.
ur: آپکے @drupa کا ڈیٹابیس %db_type کے نام سے محفوظ ھوگا۔اسے اپکے سرور پر @drupal کو انسٹال کرنے سے پہلے ھونا چاھیے۔
zh_hans: 您的 @drupal 数据要保存到的 %db_type 数据库名称。在 @drupal 安装前必须准备好。

source: Database name
ur: ڈیٹابیس کا نام
zh_hans: 数据库名称

source: Database username
ur: ڈیٹابیس یوزرنیم
zh_hans: 数据库用户名

source: Database password
ur: ڈیٹابیس کا پاسورڈ
zh_hans: 数据库密码

source: Advanced options
ur: اڈوانس انتخابات
zh_hans: 高级选项

source: These options are only necessary for some sites. If you're not sure what you should enter here, leave the default settings or check with your hosting provider.
ur: یہ اپشنز صرف کچھ سائیٹ کے لیے ھے۔اگر آپکو نھیں معلوم کے یھاں کیا لکھنا ھے،اسے ڈیفلالٹ سیٹ انگز پر رھنے دیں یا اپنے ھوسٹنگ پرواۓڈر سے رابطہ کیجھیے۔
zh_hans: 只有少数网站需要设置以下选项。如果您不确定，请使用默认设置，或者与空间服务商联系。

source: Database host
ur: ڈیٹابیس ھوسٹ
zh_hans: 数据库主机

source: If your database is located on a different server, change this.
ur: اگر آپکا ڈیٹا بیس کسی اور سرو پر ھے ،تو اسے بدلیے۔
zh_hans: 如果您的数据库位于另一台服务器，请修改这里。

source: Database port
ur: ڈیٹا بیس پورٹ
zh_hans: 数据库端口

source: If your database server is listening to a non-standard port, enter its number.
ur: اگر آپکا ڈیٹابیس سرور کسی نان-سٹینڈرڈ پوٹ کو سن رہا ھے تو اسکا نمبر دیجیے
zh_hans: 如果您的数据库服务器是监听非标准端口（3306），请填写所使用的端口号码。

source: Table prefix
ur: ٹیبل پریفکس
zh_hans: 数据库表前缀

source: If more than one application will be sharing this database, enter a table prefix such as %prefix for your @drupal site here.
ur: گر ایک سے زیادہ اپلیکیشن اس ڈیٹا بیس سے کنیکٹ کررہی ہو نگی تو ایک ٹیبل الصاق داخل کریں جیسے کہ @drupalمیں آپ کیلئے دیا گیا ہے
zh_hans: 如果需要在一个数据库中安装多个程序,为了区分管理,您可以为您的@drupal网站输入一个类似%prefix的数据表前缀。

source: Save and continue
ur: محفو ظ کرو اور جاری رکھو
zh_hans: 保存并继续

source: The database table prefix you have entered, %db_prefix, is invalid. The table prefix can only contain alphanumeric characters, periods, or underscores.
ur: جو ڈیٹا بیس ٹیبل الصاق داخل کیا جا چکا ہے وہ غلط ہے۔ٹیبل صرف پریڈز ،چریکٹر، یا انڈر سکور اور الفا نومیرک پر مشتمل ہو سکتا ہے
zh_hans: 您输入的数据表前缀 %db_prefix 是无效的，仅可使用数字,字母,英文句号和下划线.

source: Database port must be a number.
ur: ڈیٹابیس پورٹ کو ایک نمبر ھونا چاھیے۔
zh_hans: 数据库端口必须是一组数值。

source: In your %settings_file file you have configured @drupal to use a %db_type server, however your PHP installation currently does not support this database type.
ur: %settings_file کی فائیل کی سیٹ انگ میں آپ نے @drupalکی کنفگریشن کی تاکہ %db_type server کو استعمال کیا جاسکے، مگر اپک پی ایچ پی انسٹالیشن فی الحال اس ڈیٹابیس ٹائیپ کو پورٹ نھیں کرتا۔
zh_hans: 在您的 %settings_file 文件中，您设置 @drupal 使用 %db_type 服务器，但您的PHP安装不支持这一数据库类型。

source: In order for Drupal to work, and to continue with the installation process, you must resolve all permission issues reported above. We were able to verify that we have permission for the following commands: %commands. For more help with configuring your database server, see the <a href="http://drupal.org/node/258">Installation and upgrading handbook</a>. If you are unsure what any of this means you should probably contact your hosting provider.
zh_hans: 为了让Drupal正常运行并继续安装进程，您必须解决以上报告的所有权限问题。我们能确定的已经具有以下命令的权限：%commands，更多数据库配置的相关帮助请见<a href="http://drupal.org/node/258">安装与升级手册</a>。如果您不懂以上问题的含义，您最好联系您的主机提供者。

source: Select an installation profile
ur: ایک انسٹالیشن پروفائیل چنیے
zh_hans: 选择一个安装包(profile)

source: Choose language
ur: زبان منتخب کریں
zh_hans: 选择语言

source: With the addition of an appropriate translation package, this installer is capable of proceeding in another language of your choice. To install and use Drupal in a language other than English:
ur: ایک مناسب ترجمہ کے پیکج کے اضافے کے ساتھ یہ انسٹالر آپ کی مرضی کی زبان میں کاروائی کی صلاحیت رکھتا ہے۔ (آپ )ڈرپل کو انگریزی (اور اس کے) علاوہ کسی بھی زبان میں انسٹال ،اور استعمال بھی کر سکتے ہیں
zh_hans: 当添加了适当的翻译包之后，本安装程序可以使用您选择的语言运行。要通过非英语安装、使用Drupal：

source: Determine if <a href="@translations" target="_blank">a translation of this Drupal version</a> is available in your language of choice. A translation is provided via a translation package; each translation package enables the display of a specific version of Drupal in a specific language. Not all languages are available for every version of Drupal.
ur: اس (ڈرپل ورژن )کا ترجمہ آپ کی من پسند زبان میں فراہم کیا گیا ہے۔۔ترجمہ مناسب ترجماتی پیکیج میں مہیا کیا گیا ہے۔۔ہر ترجماتی پیکج میں(ڈرپل) کے مخصوص ورژنز کو مخصوص زبان میں دکھایا گیا ہے تمام زبانیں ڈرپل کے ہر ورژن کے لیئے موزوں نہیں ہیں
zh_hans: 请确定是否有您所选语言的<a href="@translations" target="_blank">Drupal翻译版本</a>可用。翻译是以语言包形式实现的；每个语言包使得特定版本的Drupal以特定的语言显示。不是每个Drupal版本都有所有的语言可用。

source: If an alternative translation package of your choice is available, download and extract its contents to your Drupal root directory.
ur: اگر آپ کی من پسند (زبان)کا متبادل ترجماتی پیکیج مہیا ہو اسے ڈاؤن لوڈ کریں اور اپنی ڈرپل روٹ ڈاریکٹری میں اکسٹریکٹ کریں
zh_hans: 选择了正确的本地化翻译文件包后，下载并在您的Drupal根目录把它解压缩。

source: Return to choose language using the second link below and select your desired language from the displayed list. Reloading the page allows the list to automatically adjust to the presence of new translation packages.
ur: نیچے دئے گئے دوسرے لنک کو استعما ل کرتے ہوئے منتخب زبان کے (آپشن)پر واپس آئیں اور دی گئی لسٹ میں سے اپنی مطلوبہ زبان کو منتخب کیجئے ۔صفحہ کو دوبارہ لوڈ کریں تا کہ لسٹ میں سے نیا ترجماتی پیکیج خو د کار طریقے سے ایڈجسٹ ہو سکے۔
zh_hans: 返回选择语言(使用下面的第二个链接)并从显示的列表中选择您要的语言。刷新该页面可以自动整理您新加的语言包并显示在列表里。

source: Alternatively, to install and use Drupal in English, or to defer the selection of an alternative language until after installation, select the first link below.
ur: متبادل طور پر (ڈروپل)کو انگریزی میں انسٹال کریں اور استعمال کریں ۔ یا پھر متبادل زبان کا انتخاب روک دیں ۔تا ہم انسٹالیشن کے بعد نیچے دیئے گئے پہلے لنککو منتخب کریں
zh_hans: 如果您想以英语安装并使用Drupal，或者在安装完成后再选择其它语言，请选择下面的第一个链接。

source: How should the installation continue?
ur: کیسے انسٹالیشن جاری رکھنی چاہیے؟
zh_hans: 准备如何继续安装？

source: Continue installation in English
ur: انسٹالیشن انگریزی میں جاری رکھیں۔
zh_hans: 继续使用英语安装

source: Return to choose a language
ur: زبان منتخب (کرنے کے آپشن)پر واپس آئیں
zh_hans: 返回进行语言选择

source: Install Drupal in English
ur: ڈروپل کو انگریزی میں انسٹال کریں
zh_hans: 使用英语安装Drupal

source: Learn how to install Drupal in other languages
ur: سیکھیئے کہ (ڈروپل )کو دوسری زبانوں میں کس طرح انسٹال کیا جاتا ہے
zh_hans: 了解如何使用其他语言安装

source: (built-in)
zh_hans: （内建）

source: Select language
ur: زبان منتخب کریں
zh_hans: 选择语言

source: No profiles available
ur: کوئی پروفائیل دستیاب نہیں
zh_hans: 没有可用的安装包

source: We were unable to find any installer profiles. Installer profiles tell us what modules to enable and what schema to install in the database. A profile is necessary to continue with the installation process.
ur: ھمیں کوئی انسٹالر پروفائیل نھیں ملی۔انسٹالر پروفائیل ھمیں بتاتی ھے کے کون سے موڈیولز کو فعال کرنا ھےاور کونسا سکیما ڈیٹابیس میں انسٹال کرنا ھے-پروفائیل ضروری ھوتی ھے انسٹالیشن کے عمل کو آگے برھانے کے لی۔
zh_hans: 无法找到任何安装包(intaller profiles)。安装包指导需要我们启用哪些模块以及创建哪些数据库文件。安装程序必须有安装包才能继续。

source: Drupal already installed
ur: ڈروپل پہلے ہی انسٹالڈ ھے
zh_hans: Drupal已经安装

source: <ul><li>To start over, you must empty your existing database.</li><li>To install to a different database, edit the appropriate <em>settings.php</em> file in the <em>sites</em> folder.</li><li>To upgrade an existing installation, proceed to the <a href="@base-url/update.php">update script</a>.</li><li>View your <a href="@base-url">existing site</a>.</li></ul>
zh_hans: <ul><li>全新开始安装，您必须清空已有的数据库。</li><li>若要安装到不同的数据库，请编辑<em>settings.php</em>文件(在<em>sites</em>目录里)。</li><li>若要升级当前已安装的Drupal，请执行<a href="@base-url/update.php">更新脚本</a>。</li><li>查看<a href="@base-url">已安装Drupal的站点</a>。</li></ul>

source: Installing @drupal
ur: ا نسٹال ہو رہا ہے @drupal
zh_hans: 正在安装 @drupal

source: The installation has encountered an error.
ur: انسٹالیشن کو ایک غلطی کا سامنا ہے
zh_hans: 安装过程中遇到一个错误

source: Configure site
ur: سائیٹ ۔تشکیل دی جا رہی ہے
zh_hans: 设置站点

source: All necessary changes to %dir and %file have been made, so you should remove write permissions to them now in order to avoid security risks. If you are unsure how to do so, please consult the <a href="@handbook_url">on-line handbook</a>.
zh_hans: 所有需要对%dir和%file的变更已经完成，因此为了安全您应去掉它们的写权限。如果您不懂怎么做，请参考<a href="@handbook_url">在线手册</a>。

source: All necessary changes to %dir and %file have been made. They have been set to read-only for security.
zh_hans: 对 %dir 和 %file 的更新已完成。因为安全原因，它们被设置为只读模式。

source: Your server has been successfully tested to support this feature.
ur: آپ کا سرور اس پروگرام کے مددگار کے طور پر کامیابی کے ساتھ چیک کیا جا چکا ہے
zh_hans: 您的服务器环境已经通过测试，支持这项功能。

source: Your system configuration does not currently support this feature. The <a href="http://drupal.org/node/15365">handbook page on Clean URLs</a> has additional troubleshooting information.
zh_hans: 您的系统当前不支持该功能。 更多详细信息请参阅<a href="http://drupal.org/node/15365">简洁URLs手册</a> 。

source: Testing clean URLs...
ur: کو چیک کیا جا رہا ہے clean URLs
zh_hans: 测试简洁链接。。。

source: @drupal installation complete
ur: @drupal کی انسٹالیش مکمل ھوگئ
zh_hans: @drupal 安装完成

source: Congratulations, @drupal has been successfully installed.
ur: مبارک ھو،@drupal کامیابسی سے انسٹال ھوگیا ھے۔
zh_hans: 祝贺您，@drupal 已经成功安装。

source: Please review the messages above before continuing on to <a href="@url">your new site</a>.
ur: براہ مھربانی <a href="@url">آپکی نئ سائیٹ</a> پر آگے جانے سے پھلے اوپر دیے گۓ پیغامات پڑھیے۔
zh_hans: 在跳转到<a href="@url">您新建立的站点</a>前，请仔细阅读以上信息。

source: You may now visit <a href="@url">your new site</a>.
ur: آپ اس وقت دیکھ سکتے ھیں <a href="@url"> آپکی نئی سائیٹ</a>
zh_hans: 现在可以访问您<a href="@url">新建立的站点</a>了。

source: Installed %module module.
ur: ما ڈیول انسٹال ہو گئے ہیں %module
zh_hans: 安装 %module 模块

source: The @drupal installer requires write permissions to %file during the installation process. If you are unsure how to grant file permissions, please consult the <a href="@handbook_url">on-line handbook</a>.
zh_hans: 在 @drupal 安装过程中，需要有 %file 文件的可写权限。 如果您不知道如何修改，请参考 <a href="@handbook_url">在线手册</a>的相关内容。

source: Currently using !item !version
ur: اس وقت زیراستعمال !item !version
zh_hans: 当前使用 !item !version

source: Choose profile
ur: (پروفائل)خاکہ منتخب کریں
zh_hans: 选择安装包

source: Verify requirements
ur: مطالبات کو جانچنا (تو ثیق کرنا)
zh_hans: 验证服务器环境

source: Set up database
ur: ڈیٹا بیس بنانا
zh_hans: 设置数据库

source: Install profile
ur: ُپروفائل(خاکہ) انسٹال کرنا
zh_hans: 安装包

source: Set up translations
ur: ترجمہ کرنے کا عمل
zh_hans: 开始设置多语言

source: Install site
ur: سائیٹ انسٹال کرنا
zh_hans: 安装站点

source: Finish translations
ur: ترجمہ کے عمل کو ختم کرنا
zh_hans: 结束多语言设置

source: Finished
ur: ختم ہوا
zh_hans: 完成

source: To configure your website, please provide the following information.
ur: برائے مہربانی اپنی سائیٹ کی ترتیب کیلئے مندرجہ ذیل معلومات فراہم کریں
zh_hans: 要进行站点设置前，请先提供以下信息。

source: Site information
ur: سائیٹ کی معلومات
zh_hans: 站点信息

source: Site name
ur: سائیٹ کا نام
zh_hans: 站点名称

source: Site e-mail address
ur: ایڈریس E-mail سائیٹ کا
zh_hans: 站点电子邮件地址

source: The <em>From</em> address in automated e-mails sent during registration and new password requests, and other notifications. (Use an address ending in your site's domain to help prevent this e-mail being flagged as spam.)
zh_hans: <em>邮件发送</em>地址是用于在用户注册、重置密码和其他提醒时网站自动发送邮件所使用的邮件地址（使用以您的站点域名为结尾的地址可以防止该邮件被标记为垃圾邮件。）

source: Administrator account
ur: منتظم کا اکاؤنٹ(خاتہ)
zh_hans: 管理员帐户

source: The administrator account has complete access to the site; it will automatically be granted all permissions and can perform any administrative activity. This will be the only account that can perform certain activities, so keep its credentials safe.
ur: منتظم کا اکاؤ نٹ (کھاتہ)مکمل طور پر سائیٹ کو اکسیس کر چکا ہے ۔یہ (اکاؤنٹ)خود کار طریقے سے تمام اجازت ناموں کی منظوری دے گا۔اور کسی بھی انتظامی سرگرمی پر عملدرآمد کر سکتا ہے۔یہ وہ واحد اکاؤنٹ ہے جو کہ موجودہ سرگرمیوں پربھی عملدرآمد کر سکتا ہے ۔ پس اس کے مراسلاتی حفاظت کو یقینی بنائیں
zh_hans: 管理员帐户拥有对站点的完全控制；它将被赋予网站所有管理权限以进行管理操作。这也是唯一一个可以进行特定管理操作的帐号，请务必妥善保存。

source: Username
ur: یوزر نیم
zh_hans: 用户名

source: Spaces are allowed; punctuation is not allowed except for periods, hyphens, and underscores.
ur: کی اجازت ہے ۔رموز اوقاف کی اجازت نہیں ہے ۔ماSpaces سوائے وقف کے اور حرف ربط ،انڈر سکور کو استعمال کرنے کی اجازت بھی نھیں۔
zh_hans: 允许空格，不允许"."、“-”、“_”以外的其他符号。

source: E-mail address
ur: ای میل ایڈرس
zh_hans: 邮件地址

source: All e-mails from the system will be sent to this address. The e-mail address is not made public and will only be used if you wish to receive a new password or wish to receive certain news or notifications by e-mail.
ur: سسٹم سے اس ایڈریس پر بھیجی جا چکی ہوں گی۔۔ E-mails..تمام اس میلنگ ایڈرس کو عوامی نہیں بنایا گیا اور تبھی عمل کرے گا جب آپ چاہو گے۔اگر آپ نیا ( پاسورڈ) قبول کرنایا موجودہ خبریں،نوٹس ای میل سے مو صول کرنا چاہو تو کرسکتے ہو
zh_hans: 所有来自本站的邮件都将发送到这个地址。 此电子邮件不会被公开, 它仅用来接收重置密码，或经您同意后用于接受本站新闻或通知。

source: Server settings
ur: کی ترتیبات Server
zh_hans: 服务器设置

source: Default time zone
ur: ڈیفالٹ وقت کا زون
zh_hans: 默认时区

source: By default, dates in this site will be displayed in the chosen time zone.
ur: طبعی طور ! پر اس سائیٹ میں تاریخیں منتخب شدہ ٹائم زون میں دی گئی ہونگی۔
zh_hans: 默认情况下, 本站的日期将采用您选择的时区.

source: Clean URLs
ur: یو آر ایلز کو کلین کریں
zh_hans: 简洁链接

source: Disabled
ur: غیر فعال شدہ
zh_hans: 禁用

source: Enabled
ur: فعال شدہ
zh_hans: 启用

source: This option makes Drupal emit "clean" URLs (i.e. without <code>?q=</code> in the URL).
zh_hans: 此选项使得Drupal显示“简洁”的网址（即在URL中没有<code>?q= </code> ） 。

source: Update notifications
ur: تازہ ترین نوٹسز
zh_hans: 更新通知

source: Check for updates automatically
zh_hans: 自动检查升级

source: With this option enabled, Drupal will notify you when new releases are available. This will significantly enhance your site's security and is <strong>highly recommended</strong>. This requires your site to periodically send anonymous information on its installed components to <a href="@drupal">drupal.org</a>. For more information please see the <a href="@update">update notification information</a>.
zh_hans: 此设置启用时，当有新的发行版时Drupal会通知您。这会有效提高您的站点的安全性，<strong>强烈建议</strong>您启用。 这需要您的站点的安装组件定期发送匿名信息到 <a href="@drupal">drupal.org</a>。获取更多信息请访问 <a href="@update">升级提示信息</a>.

source: Error
ur: ایرر
zh_hans: 错误

source: MySQL database
ur: مائی ایس کیو ایل ڈیٹابیس
zh_hans: MySQL 数据库

source: Your MySQL Server is too old. Drupal requires at least MySQL %version.
ur: آپکا مائی ایس کیو ایل سرور بہت پرانا ھے۔ ڈروپل کو کم از کم %version چاھیے۔
zh_hans: MySQL 版本太低。 Drupal 至少需要 MySQL %version.

source: PostgreSQL database
ur: پوسٹگری ایس کیو ایل ڈیٹا بیس
zh_hans: PostgreSQL 数据库

source: Your PostgreSQL Server is too old. Drupal requires at least PostgreSQL %version.
ur: آپکا پوسٹگری سرور بہت پرانا ھے۔ ڈروپل کو کم ازکم پوسٹگری ایس کیو ایل کا %version چاھیے۔
zh_hans: PostgreSQL 版本太低。 Drupal 至少需要 PostgreSQL %version.

source: Your PostgreSQL database is set up with the wrong character encoding (%encoding). It is possible it will not work as expected. It is advised to recreate it with UTF-8/Unicode encoding. More information can be found in the <a href="@url">PostgreSQL documentation</a>.
ur: آپکا پوسٹرگری ایس کیو ایل ڈیٹابیس غلط کیرکٹر انکوڈانگ (%encoding) کے ساتھ سیٹ اپ ھے۔ یہ ممکن ھے یہ مطلوبہ طریقے سے کام نہ کرے۔اسلیے بہترھوگا اسکو UTF-8/انکوڈنگ کی انکوڈنگ کے ساتھ دوبارہ بنائیے۔ مزید معلومات <a href="@url">پوسٹگری ایس کیو ایل کی ڈاکومنٹیشن</a> سے حاصل ھونگی۔
zh_hans: 您的PostgreSQL数据库编码 (%encoding)格式错误，有可能不能正常工作。建议修改成 UTF-8/Unicode 编码。 更多信息请参阅<a href="@url">PostgreSQL 使用手册</a>。

source: The directory %directory does not exist.
ur: %directory کی ڈائیرکٹری وجود نہیں.
zh_hans: %directory目录不存在。

source: !name field is required.
ur: !name کی فیلڈ درکار ھے۔
zh_hans: 必须填写!name。

source: !name cannot be longer than %max characters but is currently %length characters long.
ur: !name %max حروف سے زیاد لبا نہیں ھوسکتا لیکن موجودہ طور پر یہ %length حروف جتنا لمبا ھ۔
zh_hans: 目前!name已经有%length 字节。站点设置其不能超过 %max 字节

source: An illegal choice has been detected. Please contact the site administrator.
ur: یہاں ایک نامناسب انتخاب پایا گيا ہے۔براءے مہربانی ساءيٹ ايڈمنسٹريٹر سے رجوع کيجيے
zh_hans: 发现一个非法的选择。请联系网站管理员。

source: This field is required.
ur: یہ فیلڈ درکار ھے۔
zh_hans: 此项必填。

source: Processing
ur: عمل ہو رہا ہے۔
zh_hans: 处理中

source: Initializing.
ur: آغاز کیلئے تیار ہو رہا ہے۔
zh_hans: 初始化。

source: Remaining @remaining of @total.
ur: کا باقی @total
zh_hans: 总共 @total 尚余 @remaining

source: An error has occurred.
ur: ایک غلطی واقع ہو چکی ہے
zh_hans: 出现错误

source: Please continue to <a href="@error_url">the error page</a>
ur: <a href="@error_url"> برائے مہربانی !جاری رکھیں اسے غلطی والے صفحہ کی طرف
zh_hans: 请前往<a href="@error_url">出错页面</a>

source: Failed to modify %settings, please verify the file permissions.
ur: %settings تبدیل نیہں کیا جاسکا،براہ مھربانی فائیل کی پرمیشن کی تصدیق کیجیے۔
zh_hans: 无法修改 %settings，请检查文件权限。

source: Failed to open %settings, please verify the file permissions.
ur: %settings نہیں کھولا جاسکا،براہ مھربانی فائیل کی پرمیشن کی تصدیق کیجیے۔
zh_hans: 无法打开 %settings，请检查文件权限。

source: The %module module is required but was not found. Please move it into the <em>modules</em> subdirectory.
ur: %module کے موڈیول کی ضرورت ھے لیکن یہ موجود نہیں۔ براہ مھربانی اسکو <em>مايولز </em> کی سب ڈائیرکٹری میں بھیجیے۔
zh_hans: 无法找到所需的 %module 模块，请将它移到 <em>modules</em> 子目录。

source: PHP MySQL support not enabled.
ur: پی ایچ پی مائی ایس کیو ایل سپورٹ فعال نہیں۔
zh_hans: PHP的设置尚未开启对MySQL支持。

source: Failed to connect to your MySQL database server. MySQL reports the following message: %error.<ul><li>Are you sure you have the correct username and password?</li><li>Are you sure that you have typed the correct database hostname?</li><li>Are you sure that the database server is running?</li></ul>For more help, see the <a href="http://drupal.org/node/258">Installation and upgrading handbook</a>. If you are unsure what these terms mean you should probably contact your hosting provider.
ur: آپکی *مائی ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور *سے رابطہ ناکام ہو گیا ہے۔ *مائی ۔ایس ۔کیو۔ایل* کی رپورٹیں نیچے دیئے گئے پیغام ہیں۔() کیا آپ کو یقین ہے کہ آپ نے یوزر نیم ۔اور پاسورڈ صحیح دے دیا ہے؟ () کیا آپ کو یقین ہے کہ آپ کا دیا گیا ڈیٹا بیس کا* ہوسٹ* کا نام د رست ہے؟ () کیا آپ کو یقین ہے کہ آپ کا ڈیٹا بیس سرور کام کر رہا ہے؟ <a href="http://drupal.org/node/258"> مزید مدد کیلئے دیکھیئے اگر آپ غیر یقینی صورتحال میں مبتلا ہوں کہ یہ اصلاحات کا کیا ہیں ۔تو آپ کو اپنے *ہوسٹنگ* فراہم کرنے والے سے مناسب طریقے سے رابطہ کرنا چاہیے۔
zh_hans: 连接 MySQL 数据库失败。 MySQL 错误信息: %error.<ul><li>您确认用户名和密码正确么？</li><li>是否输入了正确的主机名?</li><li>数据库是否正在运行？</li></ul>寻求更多帮助，请查阅 <a href="http://drupal.org/node/258">安装与升级手册</a>。 如果无法确认以上信息，请于主机供应商联系。

source: Failed to select your database on your MySQL database server, which means the connection username and password are valid, but there is a problem accessing your data. MySQL reports the following message: %error.<ul><li>Are you sure you have the correct database name?</li><li>Are you sure the database exists?</li><li>Are you sure the username has permission to access the database?</li></ul>For more help, see the <a href="http://drupal.org/node/258">Installation and upgrading handbook</a>. If you are unsure what these terms mean you should probably contact your hosting provider.
ur: (آپ ) اپنے*مائی ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور پر اپنی ڈیٹا بیس کے انتخاب میں ناکام ہو گئے ہیں۔اس کا مطلب ہے کہ رابطہ کا *یوزر نیم اور پاسورڈ*درست ہے۔لیکن (آپ)کے ڈیٹا *ایکسیسنگ*میں مسئلہ ہے *مائی ۔ایس ۔کیو۔ایل* کی رپورٹیں نیچے دیئے گئے پیغام ہیں۔(غلطیاں) کیا آپ کو یقین ہے کہ آپ نے جو *ڈیٹا بیس* کا نام دیا ہے وہ درست ہے ؟() کیا آپ کو یقین ہے کہ آپ کی ڈیٹا بیس واقع ہو گئی ہے؟ () کیا آپ کو یقین ہے کہ آپ کے دیئے گئے *یوزر نیم* کو ڈیٹا بیس (اکسیس) کرنے کی اجازت مل گئی ہے؟ مزید مدد کیلئے دیکھیئے <a href="http://drupal.org/node/258"> ہینڈ بک* کی انسٹالیشن اور اپ گریڈنگ کے لئے! اگر آپ غیر یقینی صورتحال میں مبتلا ہوں کہ یہ اصلاحات کا کیا ہیں ۔تو آپ کو اپنے *ہوسٹنگ* فراہم کرنے والے سے مناسب طریقے سے رابطہ کرنا چاہیے۔
zh_hans: 用户名和密码正确，但无法连接指定数据库。MySQL 错误信息: %error.<ul><li>您确认数据库名称正确么？</li><li>数据库是否存在?</li><li>所用用户名是否具有该数据库权限？</li></ul>寻求更多帮助，请查阅 <a href="http://drupal.org/node/258">安装与升级手册</a>。 如果无法确认以上信息，请于主机供应商联系。

source: Failed to create a test table on your MySQL database server with the command %query. MySQL reports the following message: %error.<ul><li>Are you sure the configured username has the necessary MySQL permissions to create tables in the database?</li></ul>For more help, see the <a href="http://drupal.org/node/258">Installation and upgrading handbook</a>. If you are unsure what these terms mean you should probably contact your hosting provider.
ur: .%query مائی ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں اس کمانڈ کے ساتھ ٹیسٹ ٹیبل تخلیق کرنے میں ناکامی ہوئی ہے۔*مائی ۔ایس ۔کیو۔ایل* کی رپورٹیں نیچے دیئے گئے پیغام ہیں۔ کیا آپ کو یقین ہے کہ *کنفگرڈ۔یوزر نیم * مائی ۔ایس ۔کیو۔ایل سے ڈیٹا بیس میں ٹیبل تخلیق کرنے کی اجازت کے لیئے ضروری ہے؟ مزید مدد کیلئے دیکھیئے <a href="http://drupal.org/node/258"> *ہینڈ بک* کی انسٹالیشن اور اپ گریڈنگ کے لئے! اگر آپ غیر یقینی صورتحال میں مبتلا ہوں کہ یہ اصلاحات کا کیا ہیں ۔تو آپ کو اپنے *ہوسٹنگ* فراہم کرنے والے سے مناسب طریقے سے رابطہ کرنا چاہیے
zh_hans: 创建测试表单(test table)失败。MySQL 错误信息: %error.<ul><li>您确认所用用户名具有相应权限么？</li></ul>寻求更多帮助，请查阅 <a href="http://drupal.org/node/258">安装与升级手册</a>。 如果无法确认以上信息，请于主机供应商联系。

source: Failed to insert a value into a test table on your MySQL database server. We tried inserting a value with the command %query and MySQL reported the following error: %error.
ur: مائی ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں،ٹیسٹ ٹیبل میں ایک قدر کے اندراج میں ناکامی ہوئی ۔ہم نے اس کمانڈ کے ساتھ قدر کے اندراج کی کوشش کی تھی۔اور مائی ۔ایس ۔کیو۔ایل نے نیچے دی گئی غلطی کی نشاندہی کی ہے
zh_hans: 测试数据写入失败。使用 %query命令，在测试表内写入一条数据时 MySQL 报告以下错误: %error。

source: Failed to update a value in a test table on your MySQL database server. We tried updating a value with the command %query and MySQL reported the following error: %error.
ur: مائی ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں،ٹیسٹ ٹیبل میں ایک قدر کی* اپ ڈیٹ *فیل ہوئی ۔ہم نے اس کمانڈ کے ساتھ قدر کے اندراج کی کوشش کی تھی۔اور مائی ۔ایس ۔کیو۔ایل نے نیچے دی گئی غلطی کی نشاندہی کی ہے
zh_hans: 测试数据更新失败。使用 %query命令，在测试表内更新一条数据时 MySQL 报告以下错误: %error。
