Repository: markwk/openatrium
Catalog: translations/*.po
Languages: ur, zh_hans

source: Failed to delete a value from a test table on your MySQL database server. We tried deleting a value with the command %query and MySQL reported the following error: %error.
ur: مائی ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں،ٹیسٹ ٹیبل میں ایک قدر* مٹانے میں*ناکامی ہوئی ۔ہم نے اس کمانڈ کے ساتھ قدر کے اندراج کی کوشش کی تھی۔اور مائی ۔ایس ۔کیو۔ایل نے نیچے دی گئی غلطی کی نشاندہی کی ہے
zh_hans: 测试数据删除失败。使用 %query命令，在测试表内删除一条数据时 MySQL 报告以下错误: %error。

source: Failed to drop a test table from your MySQL database server. We tried dropping a table with the command %query and MySQL reported the following error %error.
ur: ما ئی ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں،ٹیسٹ ٹیبل کو* ڈراپ کرنے میں *ناکامی ہوئی ۔ہم نے اس کمانڈ کے ساتھ ٹیبل ڈراپ کرنیکی کوشش کی تھی۔اور مائی ۔ایس ۔کیو۔ایل نے نیچے دی گئی غلطی کی نشاندہی کی ہے
zh_hans: 测试表单删除失败。使用 %query命令，尝试删除一个测试表单时，MySQL 报告以下错误: %error。

source: PHP MySQLi support not enabled.
ur: پی ایچ پی مائی ایس کیو ایل آئی کی سپورٹ فعال نھیں۔
zh_hans: PHP的设置尚未开启对 MySQLi支持。

source: PHP PostgreSQL support not enabled.
ur: پی ایچ پی پوسٹریچ کی سپروٹ فعال نہیں۔
zh_hans: PHP 设置未开启PostgreSQL支持。

source: Failed to connect to your PostgreSQL database server. PostgreSQL reports the following message: %error.<ul><li>Are you sure you have the correct username and password?</li><li>Are you sure that you have typed the correct database hostname?</li><li>Are you sure that the database server is running?</li><li>Are you sure you typed the correct database name?</li></ul>For more help, see the <a href="http://drupal.org/node/258">Installation and upgrading handbook</a>. If you are unsure what these terms mean you should probably contact your hosting provider.
ur: آپکی *پوسٹریج ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور *سے رابطہ ناکام ہو گیا ہے۔ *پوسٹریج۔ایس ۔کیو۔ایل* کی رپورٹیں نیچے دیئے گئے پیغام ہیں۔ کیا آپ کو یقین ہے کہ آپ نے یوزر نیم ۔اور پاسورڈ صحیح دے دیا ہے؟ () کیا آپ کو یقین ہے کہ آپ کا دیا گیا ڈیٹا بیس کا* ہوسٹ* کا نام د رست ہے؟ () کیا آپ کو یقین ہے کہ آپ کا ڈیٹا بیس سرور کام کر رہا ہے؟ مزید مدد کیلئے دیکھیئے <a href="http://drupal.org/node/258"> *ہینڈ بک* کی انسٹالیشن اور اپ گریڈنگ کے لئے! اگر آپ غیر یقینی صورتحال میں مبتلا ہوں کہ یہ اصلاحات کا کیا ہیں ۔تو آپ کو اپنے *ہوسٹنگ* فراہم کرنے والے سے مناسب طریقے سے رابطہ کرنا چاہیے۔
zh_hans: 连接到您的PostgreSQL数据库服务器失败。PostgreSQL报告了如下的信息：%error。<ul><li>您确定数据库用户名和密码是正确的吗？</li><li>您确定是否输入了正确的数据库主机名？</li><li>您确定数据库服务器是在正常运行中？</li><li>您确定是否输入了正确的数据库名？</li></ul>更多信息请查阅<a href="http://drupal.org/node/258">安装与升级手册</a>。如果您不清楚这些问题的含义，您最好联系并咨询您的主机提供商。

source: Failed to create a test table on your PostgreSQL database server with the command %query. PostgreSQL reports the following message: %error.<ul><li>Are you sure the configured username has the necessary PostgreSQL permissions to create tables in the database?</li></ul>For more help, see the <a href="http://drupal.org/node/258">Installation and upgrading handbook</a>. If you are unsure what these terms mean you should probably contact your hosting provider.
ur: *پوسٹریج ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں اس کمانڈ کے ساتھ ٹیسٹ ٹیبل تخلیق کرنے میں ناکامی ہوئی ہے۔*پوسٹریج ۔ایس ۔کیو۔ایل* کی رپورٹیں نیچے دیئے گئے پیغام ہیں۔(غلطیاں) کیا آپ کو یقین ہے کہ *کنفگرڈ۔یوزر نیم *پوسٹریج ۔ایس ۔کیو۔ایل سے ڈیٹا بیس میں ٹیبل تخلیق کرنے کی اجازت کے لیئے ضروری ہے؟ مزید مدد کیلئے دیکھیئے <a href="http://drupal.org/node/258"> *ہینڈ بک* کی انسٹالیشن اور اپ گریڈنگ کے لئے! اگر آپ غیر یقینی صورتحال میں مبتلا ہوں کہ یہ اصلاحات کا کیا ہیں ۔تو آپ کو اپنے *ہوسٹنگ* فراہم کرنے والے سے مناسب طریقے سے رابطہ کرنا چاہیے۔
zh_hans: 使用%query命令在您的PostgreSQL数据库服务器中创建测试表失败。PostgreSQL报告了以下信息：%error。<ul><li>您确定您使用的数据库用户名具备在PostgreSQL数据库中创建数据表的权限吗？</li></ul>更多信息请查阅<a href="http://drupal.org/node/258">安装与升级手册</a>。如果您不清楚这些问题的含义，您最好联系并咨询您的主机提供商。

source: Failed to insert a value into a test table on your PostgreSQL database server. We tried inserting a value with the command %query and PostgreSQL reported the following error: %error.
ur: *پوسٹریج ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں،ٹیسٹ ٹیبل میں ایک قدر کے اندراج میں ناکامی ہوئی ۔ہم نے اس کمانڈ کے ساتھ قدر کے اندراج کی کوشش کی تھی۔اور *پوسٹریج ۔ایس ۔کیو۔ایل نے نیچے دی گئی غلطی کی نشاندہی کی ہے
zh_hans: 尝试对PostgreSQL数据库的测试表单(test table)使用 %query 命令插入数据时出现错误： %error。

source: Failed to update a value in a test table on your PostgreSQL database server. We tried updating a value with the command %query and PostgreSQL reported the following error: %error.
ur: *پوسٹریج ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں،ٹیسٹ ٹیبل میں ایک قدر کی* اپ ڈیٹ *فیل ہوئی ۔ہم نے اس کمانڈ کے ساتھ قدر کیاپ ڈیٹنگ کی کوشش کی گئی تھی۔اور *پوسٹریج ۔ایس ۔کیو۔ایل نے نیچے دی گئی غلطی کی نشاندہی کی ہے
zh_hans: 尝试对PostgreSQL数据库的测试表单(test table)使用 %query 命令更新数据时出现错误： %error。

source: Failed to lock a test table on your PostgreSQL database server. We tried locking a table with the command %query and PostgreSQL reported the following error: %error.
ur: آپ کی *پوسٹریج ۔ایس ۔کیو ۔ایل میں ٹیسٹ ٹیبل کو *لاک * کرنے میں ناکامی ہوئی ۔ہم نے کمانڈ کے ساتھ ٹیسٹ ٹیبل کو لاک کرنے کی کوشش کی ۔اور پوسٹریج ۔ایس ۔کیو ۔ایل نیچے دی گئی پرابلم کی نشاندہی کی
zh_hans: 无法锁定PostgreSQL数据库服务器上的一个测试表。我们试图使用%query命令去锁定一个表，然而PostgreSQL报告了下面的错误：%error。

source: Failed to unlock a test table on your PostgreSQL database server. We tried unlocking a table with the command %query and PostgreSQL reported the following error: %error.
ur: آپ کی *پوسٹریج ۔ایس ۔کیو ۔ایل میں ٹیسٹ ٹیبل کو * ان لاک * کرنے میں ناکامی ہوئی ۔ہم نے کمانڈ کے ساتھ ٹیسٹ ٹیبل کو *ان لاک* کرنے کی کوشش کی ۔اور پوسٹریج ۔ایس ۔کیو ۔ایل نیچے دی گئی پرابلم کی نشاندہی کی
zh_hans: 无法解除PostgreSQL数据库服务器上的一个测试表的锁定。我们试图使用%query命令去解锁一个表，然而PostgreSQL报告了下面的错误：%error。

source: Failed to delete a value from a test table on your PostgreSQL database server. We tried deleting a value with the command %query and PostgreSQL reported the following error: %error.
ur: *پوسٹریج ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں،ٹیسٹ ٹیبل میں ایک قدر* مٹانے میں*ناکامی ہوئی ۔ہم نے اس کمانڈ کے ساتھ قدر کو مٹانے کی کوشش کی تھی۔اور *پوسٹریج ۔ایس ۔کیو۔ایل نے نیچے دی گئی غلطی کی نشاندہی کی
zh_hans: 无法从PostgreSQL数据库服务器上的一个测试表中删除一条记录。我们试图使用%query命令去删除一条记录，然而PostgreSQL报告了下面的错误：%error。

source: Failed to drop a test table from your PostgreSQL database server. We tried dropping a table with the command %query and PostgreSQL reported the following error %error.
ur: *پوسٹریج ۔ایس ۔کیو۔ایل ۔ڈیٹا بیس سرور میں،ٹیسٹ ٹیبل کو* ڈراپ کرنے میں *ناکامی ہوئی ۔ہم نے اس کمانڈ کے ساتھ ٹیبل ڈراپ کرنیکی کوشش کی تھی۔اور *پوسٹریج ۔ایس ۔کیو۔ایل نے نیچے دی گئی غلطی کی نشاندہی کی ہے
zh_hans: 无法删除PostgreSQL数据库服务器上的一个测试表。我们试图使用%query命令去删除表，然而PostgreSQL报告了下面的错误：%error。

source: The translation import failed, because the file %filename could not be read.
ur: ترجمے کو درآمد نہیں کیا جاسکا، کیونکہ %filename کو ریڈ نہیں کیا جاسکا۔
zh_hans: 翻译导入失败，因为无法读取文件 %filename 。

source: The translation file %filename contains an error: "msgstr" was expected but not found on line %line.
ur: ترجمے کی فائیل %filename میں ایرر ھیں : "msgstr" متوقع تھی لیکن %line لائین پر نہیں ملی۔
zh_hans: 翻译文件 %filename 有错误：第 %line 行未找到"msgstr"

source: The translation file %filename contains an error: "msgid_plural" was expected but not found on line %line.
ur: ترجمے کی فائیل %filename میں ایرر ھیں : "msgid_plural" متوقع تھی لیکن %line لائین پر نہیں ملی۔
zh_hans: 翻译文件 %filename 有错误：第 %line 行未找到"msgid_plural"

source: The translation file %filename contains a syntax error on line %line.
ur: ترجمے کی فائیل %filename میں %line لائین پر سنٹیکس ایرر ھے۔
zh_hans: 翻译文件 %filename 在第 %line 行有语法错误。

source: The translation file %filename contains an error: "msgid" is unexpected on line %line.
ur: ترجمے کی فائیل %filename میں ایرر ھیں :%line لائین پر "msgid" غیرمتوقع ھے۔
zh_hans: 翻译文件 %file 有错误：第 %line 行未找到"msgid"

source: The translation file %filename contains an error: "msgstr[]" is unexpected on line %line.
ur: ترجمے کی فائیل %filename میں ایرر ھیں :%line لائین پر "msgstr[]" غیرمتوقع ھے۔
zh_hans: 翻译档案 %filename 发生错误：在第 %line 的 "msgstr[]" 是不必要的。

source: The translation file %filename contains an error: "msgstr" is unexpected on line %line.
ur: ترجمے کی فائیل %filename میں ایرر ھیں :%line لائین پر "msgstr" غیرمتوقع ھے۔
zh_hans: 翻译文件 %filename 出现错误：在第 %line 行未找到"msgstr"。

source: The translation file %filename contains an error: there is an unexpected string on line %line.
ur: ترجمے کی فائیل %filename میں ایرر ھیں :%line لائین پر ایک غیر متوقع سٹرنگ ھے۔
zh_hans: 翻译文件 %filename 出现错误：在第 %line 行有意想不到的字符串。

source: The translation file %filename ended unexpectedly at line %line.
ur: ترجمے کی فائیل %filename غیر متوع طور پر %line کی لائین ختم ھوگئ۔
zh_hans: 翻译文件 %filename 在 %line 行意外终止。

source: Importing interface translations
ur: اتصالی تراجم کی درآمدگی
zh_hans: 正在导入界面翻译

source: Starting import
ur: درآمد کی شروعات
zh_hans: 开始导入

source: Error importing interface translations
ur: اتصالی تراجم کی درآمدگی میں غلطی
zh_hans: 导入界面翻译出错

source: The following errors must be resolved before you can continue the installation process
ur: مندرجہ ذیل ایررز کو انسٹالیشن کو آگے بڑھانے سے پھلے حل کرنا ضروری ھے
zh_hans: 必须修复下列错误才可以继续安装

source: The following error must be resolved before you can continue the installation process
ur: اس انسٹالیشن کی تنبیہات کا بغور جائزہ لیں ،لیکن زیادہتر موقعوں پر اسے نظر انداز بھی کیا جا سکتا ھے
zh_hans: 必须修复下列错误才可以继续安装

source: Please check the error messages and <a href="!url">try again</a>.
ur: برائے مہربانی غلطی کے پیغام کو چیک کریں اور دوبارہ کوشش کریں
zh_hans: 请查看错误信息并<a href="!url">再试一次</a>.

source: The following installation warnings should be carefully reviewed
ur: نیچے دی گئی انسٹالیشن کی انتباہ کو احتیاط سے جانچ لینا چاہیے
zh_hans: 请仔细检查下面的安装警告

source: The following installation warning should be carefully reviewed
ur: نیچے دی گئی انسٹالیشن کی انتباہ کو احتیاط سے جانچ لینا چاہیے۔
zh_hans: 请仔细阅读下面的安装警告

source: The following installation warnings should be carefully reviewed, but in most cases may be safely ignored
ur: اس انسٹالیشن کی تنبیہات کا بغور جائزہ لیں ،لیکن زیادہتر موقعوں پر اسے نظر انداز بھی کیا جا سکتا ھے
zh_hans: 请仔细阅读下面的安装警告，但在大多数情况下这些警告可以忽略。

source: The following installation warning should be carefully reviewed, but in most cases may be safely ignored
ur: اس انسٹالیشن کی تنبیہ کا بغور جائزہ لیں ،لیکن زیادہتر موقعوں پر اسے نظر انداز بھی کیا جا سکتا ھے
zh_hans: 请仔细阅读下面的安装警告，但在大多数情况下这些警告可以忽略。

source: The PCRE library in your PHP installation is outdated. This will cause problems when handling Unicode text. If you are running PHP 4.3.3 or higher, make sure you are using the PCRE library supplied by PHP. Please refer to the <a href="@url">PHP PCRE documentation</a> for more information.
ur: آپ کے پی ایچ پی اسنٹالیشن میں پی سی ار ایی لائیبریری پرانی ھے۔یونی کوڈ کی عبارتوں کو سنبھالتے ھوۓ یہ مسئلہ پیدا کرےگا۔اگر آپ پی ایچ پی 4.3.3 یا س سے اآگےکا کوئ ورژن استعمال کررھے ھیں تو یقین کر لیں کے آپ وھی پی سی آر ایی لائیبریری استعمال کررھے ھیں جو پی ایچ پی کے ساتھ آئ ھے۔مزید معلومات کے لیے <a href="@url"> پی ایچ پی پی سی ار ایی ڈاکومنٹیشن</a> دیکھیے۔
zh_hans: 您的PHP安装的PCRE库已过时。这会造成对Unicode文本处理上的问题。如果您使用PHP 4.3.3以上版本，请确认您使用的PHP提供的PCRE库。更多信息可参见<a href="@url">PHP PCRE 文档</a>。

source: Operations on Unicode strings are emulated on a best-effort basis. Install the <a href="@url">PHP mbstring extension</a> for improved Unicode support.
ur: یونی کوڈ سٹرنگز پر آپیریشنانکی بھترین کارکردگی کی بنیاد پر کیے جاتے ھیں۔بھتر یونی کوڈ سپورٹ ک لیے a href="@url">پی ایچ پی ایمبیسٹرنگ ایکسٹنشن</a> دیکھیے۔
zh_hans: Unicode字串的处理尽可能基于最佳仿真结果。要改进对Unicode的支持，请安装<a href="@url">PHP mbstring 扩展</a>。

source: Multibyte string function overloading in PHP is active and must be disabled. Check the php.ini <em>mbstring.func_overload</em> setting. Please refer to the <a href="@url">PHP mbstring documentation</a> for more information.
ur: پی ایچ پی میں ملٹی بائیٹ سٹرنگ سٹرنگ فنکشن اوورلوڈانگ فعال ھے اور اسے غیر فعال کرنا ھوگا۔ پی ایچ پی.انی <em>mbstring.func_overload</em> ی سیٹ انگ دیکھیے۔مزید معلومات کے لیے <a href="@url">پی ایچ پی ایمبیسٹرنگ ڈاکومنٹیشن </a> دیکھیے
zh_hans: PHP的多字节字符串函数超载被启用，必须关闭此功能。请检查您的 php.ini 文件中的<em>mbstring.func_overload</em>设置。更多信息请参考<a href="@url">PHP mbstring文档</a>。

source: Multibyte string input conversion in PHP is active and must be disabled. Check the php.ini <em>mbstring.encoding_translation</em> setting. Please refer to the <a href="@url">PHP mbstring documentation</a> for more information.
ur: پی ایچ پی میں ملٹی بائیٹ سٹرنگ انپٹ میں تبدلی فعال ھے اور اسے غیر فعال کرنا ھوگا۔ پی ایچ پی.انی <em>mbstring.encoding_translation</em> ی سیٹ انگ دیکھیے۔مزید معلومات کے لیے <a href="@url">پی ایچ پی ایمبیسٹرنگ ڈاکومنٹیشن </a> دیکھیے
zh_hans: PHP的多字节字符串输入转换被启用，必须关闭此功能。请检查您的 php.ini 文件中的<em>mbstring.encoding_translation</em>设置。更多信息请参考<a href="@url">PHP mbstring文档</a>。

source: Multibyte string input conversion in PHP is active and must be disabled. Check the php.ini <em>mbstring.http_input</em> setting. Please refer to the <a href="@url">PHP mbstring documentation</a> for more information.
ur: پی ایچ پی میں ملٹی بائیٹ سٹرنگ انپٹ میں تبدلی فعال ھے اور اسے غیر فعال کرنا ھوگا۔ پی ایچ پی.انی <em>mbstring.http_input</em> ی سیٹ انگ دیکھیے۔مزید معلومات کے لیے <a href="@url">پی ایچ پی ایمبیسٹرنگ ڈاکومنٹیشن </a> دیکھیے
zh_hans: PHP的多字节字符串输入转换被启用，必须关闭此功能。请检查您的 php.ini 文件中的<em>mbstring.http_input</em>设置。更多信息请参考<a href="@url">PHP mbstring文档</a>。

source: Multibyte string output conversion in PHP is active and must be disabled. Check the php.ini <em>mbstring.http_output</em> setting. Please refer to the <a href="@url">PHP mbstring documentation</a> for more information.
ur: پی ایچ پی میں ملٹی بائیٹ سٹرنگ آؤٹ پٹ میں تبدلی فعال ھے اور اسے غیر فعال کرنا ھوگا۔ پی ایچ پی.انی <em>mbstring.http_output</em> ی سیٹ انگ دیکھیے۔مزید معلومات کے لیے <a href="@url">پی ایچ پی ایمبیسٹرنگ ڈاکومنٹیشن </a> دیکھیے
zh_hans: PHP的多字节字符串输出转换被启用，必须关闭此功能。请检查您的 php.ini 文件中的<em>mbstring.http_output</em>设置。更多信息请参考<a href="@url">PHP mbstring文档</a>。

source: Standard PHP
ur: پی ایچ پی معیار
zh_hans: 标准 PHP

source: PHP Mbstring Extension
ur: پی ایچ پی ایمبیسٹرنگ ایکسنٹیشن
zh_hans: PHP Mbstring 扩展

source: Unicode library
ur: یونی کوڈ لائیبریری
zh_hans: Unicode 库

source: Navigation
ur: نیویگیشن
zh_hans: 导航

source: The navigation menu is provided by Drupal and is the main interactive menu for any site. It is usually the only menu that contains personalized links for authenticated users, and is often not even visible to anonymous users.
zh_hans: Drupal 所提供的导航菜单，是网站主要的互动菜单。它通常是唯一包括了注册用户个人化链接的菜单，匿名用户通常看不到此菜单。

source: Primary links
zh_hans: 主导航链接

source: Primary links are often used at the theme layer to show the major sections of a site. A typical representation for primary links would be tabs along the top.
zh_hans: 主导航链接通常是使用在外观主题中，用于引导用户到网站的主要单元。一个主导航链接的典型呈现方式，是在网站上方的页签(tab)式链接。

source: Secondary links
zh_hans: 次链接

source: Secondary links are often used for pages like legal notices, contact details, and other secondary navigation items that play a lesser role than primary links
zh_hans: 次导航链接通常用来使用条款、联络我们和其它一些重要性较低的次要导航链接，

source: Page
ur: پیج
zh_hans: 页面

source: File system
ur: فائیل سسٹم
zh_hans: 文件系统

source: Web server
ur: ویب سرور
zh_hans: Web服务器

source: Your PHP installation is too old. Drupal requires at least PHP %version.
ur: آپ کے پی ایچ پی کے انسٹالیشن بھت پرانی ھیں۔ڈروپل کو کم از کم پی ایچ پی %version درکار ھے۔
zh_hans: 您的PHP版本太老。Drupal需要至少PHP %version 以上版本。

source: <em>register_globals</em> is enabled. Drupal requires this configuration directive to be disabled. Your site may not be secure when <em>register_globals</em> is enabled. The PHP manual has instructions for <a href="http://php.net/configuration.changes">how to change configuration settings</a>.
zh_hans: <em>register_globals</em> 已启用。Drupal 需要关闭此设定。如果开启了 <em>register_globals</em>，您的网站可能会不安全。PHP 的使用手册里有关於<a href="http://php.net/configuration.changes">如何改变设定值</a>的说明。

source: Enabled ('@value')
zh_hans: 已启用 ('@value')

source: PHP memory limit
zh_hans: PHP内存限制

source: Consider increasing your PHP memory limit to %memory_minimum_limit to help prevent errors in the installation process.
zh_hans: 请考虑将您的PHP内存限制提升到 %memory_minimum_limit，以避免在安装过程中发生错误。

source: Consider increasing your PHP memory limit to %memory_minimum_limit to help prevent errors in the update process.
zh_hans: 请考虑将您的PHP内存限制提升到 %memory_minimum_limit，以避免在更新过程中发生错误。

source: Depending on your configuration, Drupal can run with a %memory_limit PHP memory limit. However, a %memory_minimum_limit PHP memory limit or above is recommended, especially if your site uses additional custom or contributed modules.
zh_hans: 根据您的设定，Drupal 可以在 %memory_limit PHP 内存限制下执行。然而建议您采用 %memory_minimum_limit PHP 内存限制或更高的值，特别是如果您的网站会使用额外的模块时。

source: Increase the memory limit by editing the memory_limit parameter in the file %configuration-file and then restart your web server (or contact your system administrator or hosting provider for assistance).
zh_hans: 编辑 %configuration-file 文件中的内存限制参数，并重新启动网站服务器，可以提高您的内存限制（或联络您的系统管理者或主机营运商，寻求他们的协助）。

source: Contact your system administrator or hosting provider for assistance with increasing your PHP memory limit.
zh_hans: 联络您的系统管理者或主机营运商，以协助您提升 PHP 内存限制。

source: See the <a href="@url">Drupal requirements</a> for more information.
zh_hans: 请参考 <a href="@url">Drupal 系统需求</a>以了解更多信息。

source: Not protected
ur: پروٹیکڈٹ نہیں ھے
zh_hans: 未保护

source: The directory %file is not protected from modifications and poses a security risk. You must change the directory's permissions to be non-writable.
zh_hans: 目录 %file 未设置修改保护而造成安全隐患。您必须改变目录的权限为只读。

source: The file %file is not protected from modifications and poses a security risk. You must change the file's permissions to be non-writable.
ur: %file فائیل تبدیلی کے لیے پرٹٹڈ نہیں اور اسے سکیورٹی رسک لاحق ھے۔آپ کو فائیل کی پرمیشنز کو نان-رائیٹایبل میں تبدیل کرنا ھوگا۔
zh_hans: 文件 %file 未设置修改保护而造成安全隐患。您必须改变文件为只读。

source: Protected
ur: پروٹیکڈٹ
zh_hans: 被保护

source: Configuration file
ur: کنفگریشن کی فائیل
zh_hans: 配置文件

source: For more information, see the online handbook entry for <a href="@cron-handbook">configuring cron jobs</a>.
zh_hans: 更多信息，请参考<a href="@cron-handbook">设定 cron jobs</a> 的线上说明。

source: Cron has not run. Please visit the <a href="@status">status report</a> for more information.
zh_hans: 没有执行 cron。请查看<a href="@status">状态报告</a>以取得更多信息。

source: Never run
ur: کبھی نہ چلائیے
zh_hans: 从未运行

source: Cron has not run.
zh_hans: 没有执行 cron。

source: Last run !time ago
ur: آخری بار !time دیر پھلے چلاایا گیا۔
zh_hans: 上一次执行是在 !time 以前

source: Cron has not run recently.
zh_hans: 最近没有执行 cron。

source: Cron maintenance tasks
ur: کران رائیٹایبل کام
zh_hans: Cron 维护任务

source: You can <a href="@cron">run cron manually</a>.
ur: آپ <a href="@cron"> کران کو دستی طور پر چلا سکتے ھیں</a>۔
zh_hans: 您可以<a href="@cron">手动运行cron</a>。

source: Not writable
ur: رائیٹایبل نہیں
zh_hans: 不可写

source: The directory %directory is not writable.
ur: %directory ڈائریکٹری رائیٹایبل نہیں۔
zh_hans: 目录 %directory 不可写。

source: You may need to set the correct directory at the <a href="@admin-file-system">file system settings page</a> or change the current directory's permissions so that it is writable.
ur: آپکو <a href="@admin-file-system"> فائیل سسٹ سیٹانگ پیج</a> پر صحیح ڈائیریکٹری سیٹ کرنی ھوگی یا موجودہ ڈائرکٹری کی پرمیشن سیٹانگز بدل کر رائیٹایبل ھونگی۔
zh_hans: 您可能需要在 <a href="@admin-file-system">文件系统设置</a> 页面设定正确的文件夹路经，或者将现在使用的文件夹权限改为可写。

source: An automated attempt to create this directory failed, possibly due to a permissions problem. To proceed with the installation, either create the directory and modify its permissions manually, or ensure that the installer has the permissions to create it automatically. For more information, please see INSTALL.txt or the <a href="@handbook_url">on-line handbook</a>.
zh_hans: 尝试自动建立目录失败，可能是因为权限问题。要继续安装程序，请手动建立并修改目录权限，或是确定安装程序拥有建立目录的权限。更多信息，请参考 INSTALL.txt 或<a href="@handbook_url">线上说明</a>。

source: Writable (<em>public</em> download method)
ur: رائٹایبل (<em> پبلک</em>ڈاؤننلوڈ کا طریقہ)
zh_hans: 可写(<em>公开</em>下载模式)

source: Writable (<em>private</em> download method)
ur: رائٹایبل (<em>پرائویٹ </em>ڈاؤنلنوڈ کا طریقہ)
zh_hans: 可写(<em>私有</em>下载模式)

source: Database updates
zh_hans: 数据库更新

source: Up to date
ur: اپ ٹو ڈیٹ
zh_hans: 最新的

source: Out of date
ur: اؤٹ اف ڈیٹ
zh_hans: 已过期

source: Some modules have database schema updates to install. You should run the <a href="@update">database update script</a> immediately.
ur: کچھ ماڈیولز کے ڈیبٹابیس سکیما اپڈیٹس کے ماڈیولز انسٹال کرنے ھوتے ھیں۔آپکو فوری طور پر <a href="@update">ڈیٹا بیس اپڈیٹ سکرپٹ </a> چلانا چاھیے۔
zh_hans: 有些模块需要更新数据库表单结构。您应该立刻执行 <a href="@update">数据库更新脚本</a>。

source: The update.php script is accessible to everyone without authentication check, which is a security risk. You must change the $update_free_access value in your settings.php back to FALSE.
zh_hans: update.php 脚本可以被任何人不通过权限检验而存取，这是一个安全性问题。您必须修改 settings.php 文件里的 $update_free_access 的值为 FALSE。

source: Access to update.php
zh_hans: 存取 update.php

source: Not enabled
zh_hans: 未启用

source: Update notifications are not enabled. It is <strong>highly recommended</strong> that you enable the update status module from the <a href="@module">module administration page</a> in order to stay up-to-date on new releases. For more information please read the <a href="@update">Update status handbook page</a>.
zh_hans: 未启用更新通知。<strong>强烈建议</strong>您在<a href="@module">模块管理</a>里启用更新状态模快(update status module)，以即时得到更新版本的通知。更多信息请参考<a href="@update">更新状态说明文件</a>。

source: HTTP request status
zh_hans: HTTP 请求状态

source: Fails
zh_hans: 失败

source: Your system or network configuration does not allow Drupal to access web pages, resulting in reduced functionality. This could be due to your webserver configuration or PHP settings, and should be resolved in order to download information about available updates, fetch aggregator feeds, sign in via OpenID, or use other network-dependent services.
zh_hans: 您的系统或网络设定不允许 Drupal 存取这些网页，导致有些功能不能正常运行。这可能是因为您的网站服务器设定或是 PHP 设定有问题。您必须解决这一问题，才能下载可用更新信息、抓取聚合内容、通过 OpenID 登入，或是使用其它依赖网络的服务。

source: A <em>page</em>, similar in form to a <em>story</em>, is a simple method for creating and displaying information that rarely changes, such as an "About us" section of a website. By default, a <em>page</em> entry does not allow visitor comments and is not featured on the site's initial home page.
zh_hans: <em>静态页(page)</em>与<em>新闻页(story)</em>基本类似，区别主要在于静止页一般用于内容相对静态、不需经常更新的页面，如介绍网站的“关于本站”页面等。静止页默认设置为不开放用户评论，并且不推荐到首页。

source: Story
ur: کھانی
zh_hans: 新闻(story)

source: A <em>story</em>, similar in form to a <em>page</em>, is ideal for creating and displaying content that informs or engages website visitors. Press releases, site announcements, and informal blog-like entries may all be created with a <em>story</em> entry. By default, a <em>story</em> entry is automatically featured on the site's initial home page, and provides the ability to post comments.
zh_hans: <em>新闻页</em>与<em>静态页</em>类似，主要区别在于新闻页一般用于直接面对用户或与用户有互动的页面，比如公司新闻发布、站点通告、近似blog类型的文章发布等，一般都以<em>新闻</em>类型发布。新闻页默认设置为允许用户发表评论，并推荐到网站首页。

source: PHP
ur: پی ایچ پی

source: Drupal
ur: ڈروپل
